{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-BROKER",
    "2": "I-BROKER",
    "3": "B-CARGO",
    "4": "I-CARGO",
    "5": "B-CARGO_TYPE",
    "6": "I-CARGO_TYPE",
    "7": "B-CHARTERER",
    "8": "I-CHARTERER",
    "9": "B-CHARTER_TYPE",
    "10": "I-CHARTER_TYPE",
    "11": "B-CLOSE_DATE",
    "12": "I-CLOSE_DATE",
    "13": "B-CONTACT",
    "14": "I-CONTACT",
    "15": "B-DEL_PORT",
    "16": "I-DEL_PORT",
    "17": "B-DISCHARGE_PORT",
    "18": "I-DISCHARGE_PORT",
    "19": "B-DURATION",
    "20": "I-DURATION",
    "21": "B-DWT",
    "22": "I-DWT",
    "23": "B-EMAIL",
    "24": "I-EMAIL",
    "25": "B-EMAIL_TYPE",
    "26": "I-EMAIL_TYPE",
    "27": "B-ETA",
    "28": "I-ETA",
    "29": "B-ETD",
    "30": "I-ETD",
    "31": "B-FREIGHT_RATE",
    "32": "I-FREIGHT_RATE",
    "33": "B-IMO",
    "34": "I-IMO",
    "35": "B-LAYCAN",
    "36": "I-LAYCAN",
    "37": "B-LAYCAN_END",
    "38": "I-LAYCAN_END",
    "39": "B-LAYCAN_START",
    "40": "I-LAYCAN_START",
    "41": "B-LOAD_PORT",
    "42": "I-LOAD_PORT",
    "43": "B-MATCHING_REGION",
    "44": "I-MATCHING_REGION",
    "45": "B-MAX_SIZE",
    "46": "I-MAX_SIZE",
    "47": "B-MIN_SIZE",
    "48": "I-MIN_SIZE",
    "49": "B-OPEN_DATE",
    "50": "I-OPEN_DATE",
    "51": "B-OPEN_PORT",
    "52": "I-OPEN_PORT",
    "53": "B-PHONE",
    "54": "I-PHONE",
    "55": "B-PORT",
    "56": "I-PORT",
    "57": "B-QUANTITY",
    "58": "I-QUANTITY",
    "59": "B-REDEL_PORT",
    "60": "I-REDEL_PORT",
    "61": "B-REGION",
    "62": "I-REGION",
    "63": "B-RESTRICTIONS",
    "64": "I-RESTRICTIONS",
    "65": "B-TONNAGE",
    "66": "I-TONNAGE",
    "67": "B-TONNAGE_TYPE",
    "68": "I-TONNAGE_TYPE",
    "69": "B-VESSEL",
    "70": "I-VESSEL",
    "71": "B-VESSEL_TYPE",
    "72": "I-VESSEL_TYPE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-BROKER": 1,
    "B-CARGO": 3,
    "B-CARGO_TYPE": 5,
    "B-CHARTERER": 7,
    "B-CHARTER_TYPE": 9,
    "B-CLOSE_DATE": 11,
    "B-CONTACT": 13,
    "B-DEL_PORT": 15,
    "B-DISCHARGE_PORT": 17,
    "B-DURATION": 19,
    "B-DWT": 21,
    "B-EMAIL": 23,
    "B-EMAIL_TYPE": 25,
    "B-ETA": 27,
    "B-ETD": 29,
    "B-FREIGHT_RATE": 31,
    "B-IMO": 33,
    "B-LAYCAN": 35,
    "B-LAYCAN_END": 37,
    "B-LAYCAN_START": 39,
    "B-LOAD_PORT": 41,
    "B-MATCHING_REGION": 43,
    "B-MAX_SIZE": 45,
    "B-MIN_SIZE": 47,
    "B-OPEN_DATE": 49,
    "B-OPEN_PORT": 51,
    "B-PHONE": 53,
    "B-PORT": 55,
    "B-QUANTITY": 57,
    "B-REDEL_PORT": 59,
    "B-REGION": 61,
    "B-RESTRICTIONS": 63,
    "B-TONNAGE": 65,
    "B-TONNAGE_TYPE": 67,
    "B-VESSEL": 69,
    "B-VESSEL_TYPE": 71,
    "I-BROKER": 2,
    "I-CARGO": 4,
    "I-CARGO_TYPE": 6,
    "I-CHARTERER": 8,
    "I-CHARTER_TYPE": 10,
    "I-CLOSE_DATE": 12,
    "I-CONTACT": 14,
    "I-DEL_PORT": 16,
    "I-DISCHARGE_PORT": 18,
    "I-DURATION": 20,
    "I-DWT": 22,
    "I-EMAIL": 24,
    "I-EMAIL_TYPE": 26,
    "I-ETA": 28,
    "I-ETD": 30,
    "I-FREIGHT_RATE": 32,
    "I-IMO": 34,
    "I-LAYCAN": 36,
    "I-LAYCAN_END": 38,
    "I-LAYCAN_START": 40,
    "I-LOAD_PORT": 42,
    "I-MATCHING_REGION": 44,
    "I-MAX_SIZE": 46,
    "I-MIN_SIZE": 48,
    "I-OPEN_DATE": 50,
    "I-OPEN_PORT": 52,
    "I-PHONE": 54,
    "I-PORT": 56,
    "I-QUANTITY": 58,
    "I-REDEL_PORT": 60,
    "I-REGION": 62,
    "I-RESTRICTIONS": 64,
    "I-TONNAGE": 66,
    "I-TONNAGE_TYPE": 68,
    "I-VESSEL": 70,
    "I-VESSEL_TYPE": 72,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.12.0",
  "use_cache": false,
  "vocab_size": 30522
}
