{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-BROKER",
    "2": "I-BROKER",
    "3": "B-CARGO",
    "4": "I-CARGO",
    "5": "B-CHARTERER",
    "6": "I-CHARTERER",
    "7": "B-CHARTER_TYPE",
    "8": "I-CHARTER_TYPE",
    "9": "B-CONTACT",
    "10": "I-CONTACT",
    "11": "B-DISCHARGE_PORT",
    "12": "I-DISCHARGE_PORT",
    "13": "B-DWT",
    "14": "I-DWT",
    "15": "B-ETA",
    "16": "I-ETA",
    "17": "B-ETD",
    "18": "I-ETD",
    "19": "B-FREIGHT_RATE",
    "20": "I-FREIGHT_RATE",
    "21": "B-IMO",
    "22": "I-IMO",
    "23": "B-LAYCAN",
    "24": "I-LAYCAN",
    "25": "B-LOAD_PORT",
    "26": "I-LOAD_PORT",
    "27": "B-PORT",
    "28": "I-PORT",
    "29": "B-QUANTITY",
    "30": "I-QUANTITY",
    "31": "B-RESTRICTIONS",
    "32": "I-RESTRICTIONS",
    "33": "B-TONNAGE",
    "34": "I-TONNAGE",
    "35": "B-VESSEL",
    "36": "I-VESSEL",
    "37": "B-VESSEL_TYPE",
    "38": "I-VESSEL_TYPE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-BROKER": 1,
    "B-CARGO": 3,
    "B-CHARTERER": 5,
    "B-CHARTER_TYPE": 7,
    "B-CONTACT": 9,
    "B-DISCHARGE_PORT": 11,
    "B-DWT": 13,
    "B-ETA": 15,
    "B-ETD": 17,
    "B-FREIGHT_RATE": 19,
    "B-IMO": 21,
    "B-LAYCAN": 23,
    "B-LOAD_PORT": 25,
    "B-PORT": 27,
    "B-QUANTITY": 29,
    "B-RESTRICTIONS": 31,
    "B-TONNAGE": 33,
    "B-VESSEL": 35,
    "B-VESSEL_TYPE": 37,
    "I-BROKER": 2,
    "I-CARGO": 4,
    "I-CHARTERER": 6,
    "I-CHARTER_TYPE": 8,
    "I-CONTACT": 10,
    "I-DISCHARGE_PORT": 12,
    "I-DWT": 14,
    "I-ETA": 16,
    "I-ETD": 18,
    "I-FREIGHT_RATE": 20,
    "I-IMO": 22,
    "I-LAYCAN": 24,
    "I-LOAD_PORT": 26,
    "I-PORT": 28,
    "I-QUANTITY": 30,
    "I-RESTRICTIONS": 32,
    "I-TONNAGE": 34,
    "I-VESSEL": 36,
    "I-VESSEL_TYPE": 38,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.10.2",
  "use_cache": false,
  "vocab_size": 30522
}
